; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v10)
             (pred_6 ?v13 ?v2)
             (pred_11 ?v12 ?v2)
             (pred_4 ?v4 ?v12 )
	     (pred_8 ?v12)
             (pred_2 ?v8)
             (pred_1 ?v13)
             (pred_7 ?v2)
             (pred_5 ?v12)
             (pred_10 ?v13)
             (pred_9 ?v12)
             (pred_3 ))



(:action op_1
:parameters (?v3 ?v5 ?v7 ?v6)
:precondition (and (pred_2 ?v3) (pred_2 ?v5) (pred_1 ?v7) (pred_7 ?v6)
          (pred_12 ?v3 ?v5) (pred_6 ?v7 ?v6)
                   (pred_11 ?v5 ?v6) (pred_8 ?v3) 
                   (pred_5 ?v5) (pred_10 ?v7))
:effect (and  (pred_9 ?v5) (not (pred_5 ?v5))))


(:action op_5
:parameters (?v3 ?v1)
:precondition (and (pred_2 ?v3) (pred_2 ?v1)
               (pred_8 ?v3) (pred_12 ?v3 ?v1) (pred_9 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_2 ?v3) (pred_1 ?v7) 
                  (pred_8 ?v3) (pred_4 ?v7 ?v3) (pred_3 ))
:effect (and (pred_10 ?v7)
   (not (pred_4 ?v7 ?v3)) (not (pred_3 ))))


(:action op_3
:parameters (?v3 ?v9 ?v11)
:precondition (and (pred_2 ?v3) (pred_1 ?v9) (pred_1 ?v11)
                  (pred_8 ?v3) (pred_10 ?v11) (pred_4 ?v9 ?v3))
:effect (and (pred_10 ?v9) (pred_4 ?v11 ?v3)
        (not (pred_10 ?v11)) (not (pred_4 ?v9 ?v3))))

(:action op_4
:parameters (?v3 ?v7)
:precondition (and (pred_2 ?v3) (pred_1 ?v7) 
                  (pred_8 ?v3) (pred_10 ?v7))
:effect (and (pred_3 ) (pred_4 ?v7 ?v3) (not (pred_10 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_05 obj_14 obj_06 obj_11 obj_08 obj_01 obj_16 obj_09 obj_10 obj_07 obj_19 obj_12 obj_15 obj_03 obj_18
    obj_04 obj_20
    obj_02 obj_17
    )

    (:init
       (pred_3)

       (pred_2 obj_13)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_7 obj_04)
       (pred_7 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_17)

       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_06 obj_16)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_08)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_01 obj_07)
       (pred_12 obj_01 obj_16)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_16 obj_06)
       (pred_12 obj_16 obj_01)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_01)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_19 obj_18)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_03 obj_18)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_18 obj_19)
       (pred_12 obj_18 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_11)
       (pred_11  obj_01 obj_04)
       (pred_11  obj_11 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_14)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_03)
       (pred_9 obj_18)

       (pred_6  obj_02 obj_04)
       (pred_6  obj_17 obj_20)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_17 obj_10)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_4 obj_02 obj_08)
       (pred_4 obj_17 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_5 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 2
2. (op_2 obj_10 obj_17)
   deleted: (pred_4 obj_17 obj_10) (pred_3)
   added: (pred_10 obj_17)
   goals met: 0 of 2
3. (op_5 obj_10 obj_08)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_08)
   goals met: 0 of 2
4. (op_4 obj_08 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_3) (pred_4 obj_17 obj_08)
   goals met: 0 of 2
5. (op_5 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 2
6. (op_5 obj_10 obj_07)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_07)
   goals met: 0 of 2
7. (op_5 obj_07 obj_19)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_19)
   goals met: 0 of 2
8. (op_5 obj_19 obj_16)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_16)
   goals met: 0 of 2
9. (op_5 obj_16 obj_06)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_06)
   goals met: 0 of 2
10. (op_5 obj_06 obj_14)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_14)
   goals met: 0 of 2
11. (op_2 obj_14 obj_02)
   deleted: (pred_4 obj_02 obj_14) (pred_3)
   added: (pred_10 obj_02)
   goals met: 0 of 2
12. (op_1 obj_14 obj_01 obj_02 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_9 obj_01)
   goals met: 0 of 2
13. (op_5 obj_14 obj_01)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_01)
   goals met: 0 of 2
14. (op_5 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 0 of 2
15. (op_3 obj_08 obj_17 obj_02)
   deleted: (pred_10 obj_02) (pred_4 obj_17 obj_08)
   added: (pred_10 obj_17) (pred_4 obj_02 obj_08)
   goals met: 1 of 2
16. (op_5 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 1 of 2
17. (op_5 obj_01 obj_14)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_14)
   goals met: 1 of 2
18. (op_5 obj_14 obj_06)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_06)
   goals met: 1 of 2
19. (op_4 obj_06 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_3) (pred_4 obj_17 obj_06)
   goals met: 2 of 2
